<template>
  <svg
      xmlns="http://www.w3.org/2000/svg"
      class="h-5 w-5"
      viewBox="0 0 20 20"
      fill="currentColor"
  >
    <path d="M3 1a1 1 0 000 2h1.22l.305 1.222a.997.997 0 00.01.352c0 .41-.336.75-.75.75H3a1 1 0 100 2h.75c.41 0 .75.34.75.75s-.34.75-.75.75H3a1 1 0 100 2h.75c.41 0 .75.34.75.75s-.34.75-.75.75H3a1 1 0 100 2h1.38l.305 1.222a1 1 0 001.11.55H9a1 1 0 001-1V8a1 1 0 011-1h2a1 1 0 011 1v6a1 1 0 01-1 1h-2a1 1 0 01-1-1v-2a1 1 0 00-1-1H6a1 1 0 00-1 1v2a1 1 0 001 1h2a1 1 0 001-1V3a1 1 0 00-1-1H3z" />
  </svg>
</template>

<script setup>
// Компонент иконки корзины
</script>

<style scoped>
/* Дополнительные стили, если необходимо */
</style>